province = {
'A': 'Ньюфаундленд і Лабрадор',
'B': 'Нова Шотландія',
'C': 'Острів Принца Едварда',
'E': 'Нью-Брансвік',
'G': 'Квебек',
'H': 'Квебек',
'J': 'Квебек',
'K': 'Онтаріо',
'L': 'Онтаріо',
'M': 'Онтаріо',
'N': 'Онтаріо',
'P': 'Онтаріо',
'R': 'Манітоба',
'S': 'Саскачеван',
'T': 'Альберта',
'V': 'Британська Колумбія',
'X': 'Нунавут або Північно-західні території',
'Y': 'Юкон'
}
index = input('Введіть поштовий індекс адресату (наприклад, T2N): ').upper()
if ((index[0]+index[2]).isalpha() and index[1].isdigit() and len(index)==3) == False or index[0] in 'DFIOQUWZ':
    print('Ви ввели некоректний тип поштового індексу!')
else:
    print(f'Адресат з поштовим індексом {index} знаходиться в {"сільській" if index[1]==0 else "міській"} місцевості провінції {province[index[0]]}')
